JeongJiMin-github/OneModule-trunk/UI/DispDrv_Efm32g840_Omv3_Sw_Lcd.c
/**
********************************************************************************
* Copyright (c) 2006 CAS
* @brief   AD Driver Source File\n
* @file    DispDrv_Efm32g840_Omv3_Lcd.c
* @version 1.0
* @date    2012/09/19
* @author  Deok Hyun Kim (KDH)
********************************************************************************
* @remark  [Version History]\n
*          v1.0 2012/09/19 created by KDH \n
********************************************************************************
*/

/*
********************************************************************************
*                       INCLUDES
********************************************************************************
*/
/* Insert include files here */
#include "../Common/Globals.h"
#include "../Common/UiDefine.h"
#include "DispDrv.h"
#include "../Hardware/HardwareConfig.h"
#ifdef DISP_DRV_EFM32G840_OMV3_SW
#include "efm32_cmu.h"
/*
********************************************************************************
*                       GLOBAL(EXPORTED) VARIABLES & TABLES
********************************************************************************
*/
/* Insert global variables & tables here */


/*
********************************************************************************
*                       LOCAL DEFINITIONS & MACROS
********************************************************************************
*/

/* Insert #define here */
/** @brief Display 갯수*/
#define DISP_DRV_WIN_MAX_NUM	1

//#define DISP_DRV_BUF_SIZE	27
/** @brief Display driver buffer size*/
#define DISP_DRV_BUF_SIZE	18
//#define DISP_DRV_BUF_SIZE	22
#define EFM_DISP_DRV_BUF_SIZE	4


/** @brief Display driver module size*/
#define DSP_DRV_MODULE_SIZE	9
/** @brief Display driver module string size*/
#define DSP_DRV_MODULE_STR_SIZE	6

/** @brief Display driver weight address*/
#define DISP_DRV_WEIGHT_ADDR 1
/** @brief weight display size*/
#define DISP_DRV_WEIGHT_SIZE 5
//#define DISP_DRV_WEIGHT_SIZE 6

/** @brief weight display indicator address*/
#define DISP_DRV_WEIGHT_INDICATOR_ADDR 6


//Dot addr is same as digit
//Triangle addr and mask
//   0 ~ 17
//	{8, 0x20}, {8, 0x10}, {7, 0x20}, {7, 0x10}, {6, 0x20}, {6, 0x10}, 
//	{17, 0x20}, {17, 0x10}, {16, 0x20}, {16, 0x10}, {15, 0x20}, {15, 0x10},
//	{26, 0x20}, {26, 0x10}, {25, 0x20}, {25, 0x10}, {24, 0x20}, {24, 0x10} 
//BackLight Indicator addr and mask
//  if total disp window
//  {8, 0x04}

//#define DISP_DRV_ADDR_WEIGHT_MINUS		{0, 0}//RB is minus sign is not exist, so use digit 0 for minus char
//#define DISP_DRV_ADDR_UNIT_PRICE_MINUS	{0xff, 0}//not exist
//#define DISP_DRV_ADDR_TOTAL_PRICE_MINUS	{0xff, 0}//not exist
//#define DISP_DRV_ADDR_TARE_MINUS		{0xff, 0}//not exist
//#define DISP_DRV_ADDR_ZERO				{8, 0x10}//triangle 1
//#define DISP_DRV_ADDR_STABLE			{0xff, 0}//not exist
//#define DISP_DRV_ADDR_NET				{7, 0x10}//triangle 3
//#define DISP_DRV_ADDR_LOW_BATT			{0xff, 0}//not exist

/** @brief MINUS indicator, RB is minus sign is not exist, so use digit 0 for minus char*/
#define DISP_DRV_ADDR_WEIGHT_MINUS		{17, 0x02}
/** @brief Stable indicator*/
#define DISP_DRV_ADDR_STABLE			{16, 0x01}
/** @brief NET indicator*/
#define DISP_DRV_ADDR_NET				{17, 0x04}
/** @brief Low Battery indicator*/
#define DISP_DRV_ADDR_LOW_BATT		{2, 0x08}
/** @brief Ounce indicator*/
#define DISP_DRV_ADDR_OZ				{1, 0x01}
/** @brief Pound indicator*/
#define DISP_DRV_ADDR_LB				{1, 0x02}
/** @brief Kilo gram indicator*/
#define DISP_DRV_ADDR_KG				{1, 0x0c}
/** @brief Gram indicator*/
#define DISP_DRV_ADDR_GRAM			{1, 0x08}
/** @brief PCS indicator, for counting*/
#define DISP_DRV_ADDR_PCS				{0, 0x04}
/** @brief Zero indicator*/
#define DISP_DRV_ADDR_ZERO			{17, 0x01}
/** @brief High indicator, for comparator*/
#define DISP_DRV_ADDR_HI				{17, 0x08}
/** @brief Low indicator, for comparator*/
#define DISP_DRV_ADDR_LOW				{16, 0x06}
/** @brief OK indicator, for comparator*/
#define DISP_DRV_ADDR_OK				{16, 0x0c}
/** @brief OK indicator, for counting*/
#define DISP_DRV_ADDR_LACK				{16, 0x0A}



/*
	Font bit map
	---4---
	I0	 5I
	---1---
	I2	 6I
	---3---
*/
/** @brief FONT_SPACE*/
#define FONT_SPACE	0x00
/** @brief FONT_! , not exist*/
#define FONT_ASC33	0x00
/** @brief FONT_" , not exist*/
#define FONT_ASC34	0x00
/** @brief FONT_# , not exist*/
#define FONT_ASC35	0x00
/** @brief FONT_$ , not exist*/
#define FONT_ASC36	0x00
/** @brief FONT_% , not exist*/
#define FONT_ASC37	0x00
/** @brief FONT_& , not exist*/
#define FONT_ASC38	0x00
/** @brief FONT_' , not exist*/
#define FONT_ASC39	0x00
/** @brief FONT_( , not exist*/
#define FONT_ASC40	0x00
/** @brief FONT_) , not exist*/
#define FONT_ASC41	0x00
/** @brief FONT_* , not exist*/
#define FONT_ASC42	0x00
/** @brief FONT_+ , not exist*/
#define FONT_ASC43	0x00
/** @brief FONT_, , not exist*/
#define FONT_ASC44	0x00
/** @brief FONT_- , not exist*/
#define FONT_ASC45	0x08
/** @brief FONT_. , not exist*/
#define FONT_ASC46	0x00
/** @brief FONT_/ , not exist*/
#define FONT_ASC47	0x00

/** @brief FONT_0*/
#define FONT_0	0xB7
/** @brief FONT_1*/
#define FONT_1	0x14
/** @brief FONT_2*/
#define FONT_2	0xAD
/** @brief FONT_3*/
#define FONT_3	0x9D
/** @brief FONT_4*/
#define FONT_4	0x1E
/** @brief FONT_5*/
#define FONT_5	0x9B
/** @brief FONT_6*/
#define FONT_6	0xBB
/** @brief FONT_7*/
#define FONT_7	0x17
/** @brief FONT_8*/
#define FONT_8	0xBF
/** @brief FONT_9*/
#define FONT_9	0x9F

/** @brief FONT_:, not exist*/
#define FONT_ASC58	0x00
/** @brief FONT_;, not exist*/
#define FONT_ASC59	0x00
/** @brief FONT_<, not exist*/
#define FONT_ASC60	0x00
/** @brief FONT_=, not exist*/
#define FONT_ASC61	0x00
/** @brief FONT_>, not exist*/
#define FONT_ASC62	0x00
/** @brief FONT_?, not exist*/
#define FONT_ASC63	0x00
/** @brief FONT_@, not exist*/
#define FONT_ASC64	0x00

//--------- Alphabet ------------------
/** @brief FONT_A*/
#define FONT_A   0x3F
/** @brief FONT_B*/
#define FONT_B   0xBA
/** @brief FONT_C*/
#define FONT_C   0xA3
/** @brief FONT_D*/
#define FONT_D   0xBC
/** @brief FONT_E*/
#define FONT_E   0xAB
/** @brief FONT_F*/
#define FONT_F   0x2B
/** @brief FONT_G*/
#define FONT_G   0xB3
/** @brief FONT_H*/
#define FONT_H   0x3E
/** @brief FONT_I*/
#define FONT_I   0x10
/** @brief FONT_J*/
#define FONT_J   0xB4
/** @brief FONT_K*/
#define FONT_K   0x2A
/** @brief FONT_L*/
#define FONT_L   0xA2
/** @brief FONT_M*/
#define FONT_M   0x39
/** @brief FONT_N*/
#define FONT_N   0x38
/** @brief FONT_O*/
#define FONT_O   0xB8
/** @brief FONT_P*/
#define FONT_P   0x2F
/** @brief FONT_Q*/
#define FONT_Q   0x1F
/** @brief FONT_R*/
#define FONT_R   0x28
/** @brief FONT_S*/
#define FONT_S   0x9B
/** @brief FONT_T*/
#define FONT_T   0xAA
/** @brief FONT_U*/
#define FONT_U   0xB6
/** @brief FONT_V*/
#define FONT_V   0xB0
/** @brief FONT_W*/
#define FONT_W   0xB1
/** @brief FONT_X*/
#define FONT_X   0x8B
/** @brief FONT_Y*/
#define FONT_Y   0x9E
/** @brief FONT_Z*/
#define FONT_Z   0xAD

